import {COPING_OPTIONS} from "./Options";

export const COPING_QUESTIONS: Question[] = [
    {
        id: 0,
        text:
            "Оказавшись в трудной ситуации, я сосредотачивался на том, что мне нужно было делать дальше - на следующем шаге",
        options: COPING_OPTIONS,
    },
    {
        id: 1,
        text: "Оказавшись в трудной ситуации, я начинал что-то делать, зная, что это все равно не будет работать, главное - делать хоть что-нибудь",
        options: COPING_OPTIONS,
    },
    {
        id: 2,
        text:
            "Оказавшись в трудной ситуации, я пытался склонить вышестоящих к тому, чтобы они изменили свое мнение",
        options: COPING_OPTIONS,
    },
    {
        id: 3,
        text: "Оказавшись в трудной ситуации, я говорил с другими, чтобы больше узнать о ситуации",
        options: COPING_OPTIONS,
    },
    {
        id: 4,
        text: "Оказавшись в трудной ситуации, я критиковал и укорял себя",
        options: COPING_OPTIONS,
    },
    {
        id: 5,
        text: "Оказавшись в трудной ситуации, я пытался не сжигать за собой мосты, оставляя все, как оно есть",
        options: COPING_OPTIONS,
    },
    {
        id: 6,
        text: "Оказавшись в трудной ситуации, я надеялся на чудо",
        options: COPING_OPTIONS,
    },
    {
        id: 7,
        text: "Оказавшись в трудной ситуации, я смирялся с судьбой: бывает, что мне не везет",
        options: COPING_OPTIONS,
    },
    {
        id: 8,
        text: "Оказавшись в трудной ситуации, я вел себя, как будто ничего не произошло",
        options: COPING_OPTIONS,
    },
    {
        id: 9,
        text: "Оказавшись в трудной ситуации, я старался не показывать своих чувств",
        options: COPING_OPTIONS,
    },
    {
        id: 10,
        text: "Оказавшись в трудной ситуации, я пытался увидеть в ситуации что-то положительное",
        options: COPING_OPTIONS,
    },
    {
        id: 11,
        text: "Оказавшись в трудной ситуации, я спал больше обычного",
        options: COPING_OPTIONS,
    },
    {
        id: 12,
        text: "Оказавшись в трудной ситуации, я срывал свою досаду на тех, кто навлек на меня проблемы",
        options: COPING_OPTIONS,
    },
    {
        id: 13,
        text: "Оказавшись в трудной ситуации, я искал сочувствия и понимания у кого-нибудь",
        options: COPING_OPTIONS,
    },
    {
        id: 14,
        text: "Оказавшись в трудной ситуации, я во мне возникла потребность выразить себя творчески",
        options: COPING_OPTIONS,
    },
    {
        id: 15,
        text: "Оказавшись в трудной ситуации, я пытался забыть все это",
        options: COPING_OPTIONS,
    },
    {
        id: 16,
        text: "Оказавшись в трудной ситуации, я обращался за помощью к специалистам",
        options: COPING_OPTIONS,
    },
    {
        id: 17,
        text:
            "Оказавшись в трудной ситуации, я менялся или рос как личность в положительную сторону",
        options: COPING_OPTIONS,
    },
    {
        id: 18,
        text:
            "Оказавшись в трудной ситуации, я извинялся или старался все загладить",
        options: COPING_OPTIONS,
    },
    {
        id: 19,
        text: "Оказавшись в трудной ситуации, я составлял план действии",
        options: COPING_OPTIONS,
    },
    {
        id: 20,
        text: "Оказавшись в трудной ситуации, я старался дать какой-то выход своим чувствам",
        options: COPING_OPTIONS,
    },
    {
        id: 21,
        text: "Оказавшись в трудной ситуации, я понимал, что сам вызвал эту проблему",
        options: COPING_OPTIONS,
    },
    {
        id: 22,
        text: "Оказавшись в трудной ситуации, я набирался опыта в этой ситуации",
        options: COPING_OPTIONS,
    },
    {
        id: 23,
        text: "Оказавшись в трудной ситуации, я говорил с кем-либо, кто мог конкретно помочь в этой ситуации",
        options: COPING_OPTIONS,
    }, 
    {
        id: 24,
        text: "Оказавшись в трудной ситуации, я пытался улучшить свое самочувствие едой, выпивкой, курением или лекарствами",
        options: COPING_OPTIONS,
    }, 
    {
        id: 25,
        text: "Оказавшись в трудной ситуации, я рисковал напропалую",
        options: COPING_OPTIONS,
    }, 
    {
        id: 26,
        text: "Оказавшись в трудной ситуации, я старался действовать не слишком поспешно, не доверяясь первому порыву",
        options: COPING_OPTIONS,
    }, 
    {
        id: 27,
        text: "Оказавшись в трудной ситуации, я находил новую веру во что-то",
        options: COPING_OPTIONS,
    }, 
    {
        id: 28,
        text: "Оказавшись в трудной ситуации, я вновь открывал для себя что-то важное",
        options: COPING_OPTIONS,
    }, 
    {
        id: 29,
        text: "Оказавшись в трудной ситуации, я что-то менял так, что все улаживалось",
        options: COPING_OPTIONS,
    },
    {
        id: 30,
        text: "Оказавшись в трудной ситуации, я в целом избегал общения с людьми",
        options: COPING_OPTIONS,
    },
    {
        id: 31,
        text: "Оказавшись в трудной ситуации, я не допускал это до себя, стараясь об этом особенно не задумываться",
        options: COPING_OPTIONS,
    },
    {
        id: 32,
        text: "Оказавшись в трудной ситуации, я спрашивал совета у родственника или друга, которых уважал",
        options: COPING_OPTIONS,
    },
    {
        id: 33,
        text: "Оказавшись в трудной ситуации, я старался, чтобы другие не узнали, как плохо обстоят дела",
        options: COPING_OPTIONS,
    },
    {
        id: 34,
        text: "Оказавшись в трудной ситуации, я отказывался воспринимать это слишком серьезно",
        options: COPING_OPTIONS,
    },
    {
        id: 35,
        text: "Оказавшись в трудной ситуации, я говорил о том, что я чувствую",
        options: COPING_OPTIONS,
    },
    {
        id: 36,
        text: "Оказавшись в трудной ситуации, я стоял на своем и боролся за то, чего хотел",
        options: COPING_OPTIONS,
    },
    {
        id: 37,
        text: "Оказавшись в трудной ситуации, я вымещал это на других людях",
        options: COPING_OPTIONS,
    },
    {
        id: 38,
        text: "Оказавшись в трудной ситуации, я пользовался прошлым опытом - мне приходилось уже попадать в такие ситуации",
        options: COPING_OPTIONS,
    }, 
    {
        id: 39,
        text: "Оказавшись в трудной ситуации, я знал, что надо делать и удваивал свои усилия, чтобы все наладить",
        options: COPING_OPTIONS,
    }, 
    {
        id: 40,
        text: "Оказавшись в трудной ситуации, я отказывался верить, что это действительно произошло",
        options: COPING_OPTIONS,
    }, 
    {
        id: 41,
        text: "Оказавшись в трудной ситуации, я я давал обещание, что в следующий раз все будет по-другому",
        options: COPING_OPTIONS,
    },
    {
        id: 42,
        text: "Оказавшись в трудной ситуации, я находил пару других способов решения проблемы",
        options: COPING_OPTIONS,
    },
    {
        id: 43,
        text: "Оказавшись в трудной ситуации, я старался, что мои эмоции не слишком мешали мне в других делах",
        options: COPING_OPTIONS,
    },
    {
        id: 44,
        text: "Оказавшись в трудной ситуации, я что-то менял в себе",
        options: COPING_OPTIONS,
    }, 
    {
        id: 45,
        text: "Оказавшись в трудной ситуации, я хотел, чтобы все это скорее как-то образовалось или кончилось",
        options: COPING_OPTIONS,
    },
    {
        id: 46,
        text: "Оказавшись в трудной ситуации, я представлял себе, фантазировал, как все это могло бы обернуться",
        options: COPING_OPTIONS,
    },
    {
        id: 47,
        text: "Оказавшись в трудной ситуации, я молился",
        options: COPING_OPTIONS,
    }, 
    {
        id: 48,
        text: "Оказавшись в трудной ситуации, я прокручивал в уме, что мне сказать или сделать",
        options: COPING_OPTIONS,
    }, 
    {
        id: 49,
        text: "Оказавшись в трудной ситуации, я думал о том, как бы в данной ситуации действовал человек, которым я восхищаюсь и старался подражать ему",
        options: COPING_OPTIONS,
    },
]
